export interface IndexWWMI {
    name: string,
    main: string,
    sub: string,
    graph: string
}

export const IndexWMIValue: IndexWWMI[] = [
    {
        name: "(1.1) ปริมาณน้ำฝนเฉลี่ยรายปี (มม./ปี)",
        main: "M1",
        sub: null,
        graph: "Graph101"
    },
    {
        name: "(1.2) ปริมาณน้ำท่าเฉลี่ยรายปีต่อประชากร (ลบ.ม/คน/ปี)",
        main: "M1",
        sub: null,
        graph: "Graph102"
    },
    {
        name: "(1.3) ปริมาณการเติมน้ำบาดาลรายปีต่อประชากร (ลบ.ม/คน/ปี)",
        main: "M1",
        sub: null,
        graph: "Graph103"
    },
    {
        name: "(1.4) ปริมาณน้ำเก็บกักรายปีต่อประชากร (ลบ.ม/คน/ปี)",
        main: "M1",
        sub: null,
        graph: "Graph104"
    },
    {
        name: "(1.5) ปริมาณน้ำเก็บกักต่อน้ำท่า (ร้อยละ)",
        main: "M1",
        sub: null,
        graph: "Graph105"
    },
    {
        name: "(1.6) ปริมาณน้ำบาดาลที่พัฒนามาใช้ต่อประชากร (ลบ.ม/คน/ปี)",
        main: "M1",
        sub: null,
        graph: "Graph106"
    },
    {
        name: "(1.7) คุณภาพน้ำผิวดิน (ประเภทแหล่งน้ำ)",
        main: "M1",
        sub: null,
        graph: "Graph107"
    },
    {
        name: "(1.8) คุณภาพน้ำบาดาล (คะแนน)",
        main: "M1",
        sub: null,
        graph: "Graph108"
    },
    {
        name: "(2.1) ครัวเรือนในชนบทที่มีน้ำประปาใช้ต่อครัวเรือนในชนบททั้งหมด  (ร้อยละ)",
        main: "M2",
        sub: null,
        graph: "Graph201"
    },
    {
        name: "(2.2) ครัวเรือนในเขตเมืองที่มีน้ำประปาใช้ต่อคร้วเรือนในเขตเมืองทั้งหมด (ร้อยละ)",
        main: "M2",
        sub: null,
        graph: "Graph202"
    },
    {
        name: "(2.3) สถานที่ราชการที่มีน้ำประปาใช้ต่อสถานที่ราชการทั้งหมด (ร้อยละ)",
        main: "M2",
        sub: null,
        graph: "Graph203"
    },
    {
        name: "(2.4) ครัวเรือนที่มีน้ำประปาคุณภาพดีต่อคร้วเรือนทั้งหมด(ร้อยละ)",
        main: "M2",
        sub: null,
        graph: "Graph204"
    },
    {
        name: "(2.5) ปริมาณการใช้น้ำอุปโภค บริโภคต่อคน (ลิตร/คน/วัน)",
        main: "M2",
        sub: null,
        graph: "Graph205"
    },
    {
        name: "(2.6) สถานที่ราชการที่มีน้ำประปาคุณภาพดีต่อสถานที่ราชการที่มีน้ำประปาทั้งหมด (ร้อยละ)",
        main: "M2",
        sub: null,
        graph: "Graph206"
    },
    {
        name: "(2.7) เวลาที่มีน้ำประปาใช้ในรอบปี (เดือน)",
        main: "M2",
        sub: null,
        graph: "Graph207"
    },
    {
        name: "(3.1.1) พื้นที่ชลประทานต่อพื้นที่เกษตรกรรม (ร้อยละ)",
        main: "M3",
        sub: "S31",
        graph: "Graph311"
    },
    {
        name: "(3.1.2) ครัวเรือนที่มีพื้นที่เกษตรกรรมในเขตชลประทาน (ร้อยละ)",
        main: "M3",
        sub: "S31",
        graph: "Graph312"
    },
    {
        name: "(3.1.3) ความจุของอ่างเก็บน้ำต่อพื้นที่เกษตรกรรม (ลบ.ม./ไร่)",
        main: "M3",
        sub: "S31",
        graph: "Graph313"
    },
    {
        name: "(3.1.4) ผลิตภาพการใช้น้ำด้านเกษตรกรรม (บาท/ลบ.ม.)",
        main: "M3",
        sub: "S31",
        graph: "Graph314"
    },
    {
        name: "(3.1.5) คุณภาพน้ำที่ใช้ในการเกษตร (น้ำชลประทาน น้ำผิวดิน น้ำบาดาล)",
        main: "M3",
        sub: "S31",
        graph: "Graph315"
    },
    {
        name: "(3.2.1) ผลิตภาพการใช้น้ำด้านอุตสาหกรรม (บาท/ลบ.ม.)",
        main: "M3",
        sub: "S32",
        graph: "Graph321"
    },
    {
        name: "(3.2.2) คุณภาพน้ำที่ใช้ในการผลิต (น้ำประปา น้ำผิวดิน น้ำบาดาล) (ร้อยละ)",
        main: "M3",
        sub: "S32",
        graph: "Graph322"
    },
    {
        name: "(3.3.1) ผลิตภาพการใช้น้ำด้านบริการ  (บาท/ลบ.ม.)",
        main: "M3",
        sub: "S33",
        graph: "Graph331"
    },
    {
        name: "(3.3.2) คุณภาพน้ำที่ใช้ในการบริการ (น้ำประปา น้ำผิวดิน น้ำบาดาล) (ร้อยละ)",
        main: "M3",
        sub: "S33",
        graph: "Graph332"
    },
    {
        name: "(4.1) สมดุลของน้ำต้นทุนและการใช้น้ำ (ร้อยละ)",
        main: "M4",
        sub: null,
        graph: "Graph401"
    },
    {
        name: "(5.1) โรงงานอุตสาหกรรมที่มีระบบบำบัดน้ำเสียต่อโรงงานอุตสาหกรรมทั้งหมด  (ร้อยละ)",
        main: "M5",
        sub: null,
        graph: "Graph501"
    },
    {
        name: "(5.2) พื้นที่เมือง ชุมชนที่อยู่อาศัยต่อพื้นที่ทั้งหมด  (ร้อยละ)",
        main: "M5",
        sub: null,
        graph: "Graph502"
    },
    {
        name: "(5.3) หมู่บ้านที่มีระบบบำบัดน้ำเสียต่อหมู่บ้านทั้งหมด  (ร้อยละ)",
        main: "M5",
        sub: null,
        graph: "Graph503"
    },
    {
        name: "(5.4) แหล่งน้ำที่มีคุณภาพน้ำระดับพอใช้ขึ้นไป ตาม WQI  (ร้อยละ)",
        main: "M5",
        sub: null,
        graph: "Graph504"
    },
    {
        name: "(5.5) ช่วงเวลาที่มีปริมาณน้ำรักษาสมดุลนิเวศท้ายน้ำตามมาตรฐาน (เดือน)",
        main: "M5",
        sub: null,
        graph: "Graph505"
    },
    {
        name: "(5.6) ความหนาแน่นของระบบติดตามคุณภาพน้ำ(ผิวดินและบาดาล) (สถานี/ตร.กม.)",
        main: "M5",
        sub: null,
        graph: "Graph506"
    },
    {
        name: "(5.7) ความหนาแน่นของโรงงานอุตสาหกรรม (โรงงาน/ตร.กม.)",
        main: "M5",
        sub: null,
        graph: "Graph507"
    },
    {
        name: "(5.8) โรงงานอุตสาหกรรมที่มีน้ำเสียจากระบบการผลิตต่อโรงงานอุตสาหกรรมทั้งหมด (ร้อยละ)",
        main: "M5",
        sub: null,
        graph: "Graph508"
    },
    {
        name: "(6.1.1) มูลค่าความเสียหายจากน้ำท่วมต่อปี/พื้นที่น้ำทั้งหมด (บาท/ตร.กม.)",
        main: "M6",
        sub: "S61",
        graph: "Graph611"
    },
    {
        name: "(6.1.2) พื้นที่น้ำท่วมซ้ำซากต่อพื้นที่ทั้งหมด (ร้อยละ)",
        main: "M6",
        sub: "S61",
        graph: "Graph612"
    },
    {
        name: "(6.1.3) พื้นที่มีโอกาสเกิดดินถล่มต่อพื้นที่ทั้งหมด (ร้อยละ)",
        main: "M6",
        sub: "S61",
        graph: "Graph613"
    },
    {
        name: "(6.1.4) ประชากรในพื้นที่น้ำท่วมต่อประชากรทั้งหมด (ร้อยละ)",
        main: "M6",
        sub: "S61",
        graph: "Graph614"
    },
    {
        name: "(6.1.5) ความหนาแน่นของเส้นทางคมนาคมในพื้นที่น้ำท่วมซ้ำซาก (กม./ตร.กม.)",
        main: "M6",
        sub: "S61",
        graph: "Graph615"
    },
    {
        name: "(6.1.6) พื้นที่เขตเมืองในเขตพื้นที่น้ำท่วมซ้ำซากต่อพื้นที่เขตเมืองทั้งหมด (ร้อยละ)",
        main: "M6",
        sub: "S61",
        graph: "Graph616"
    },
    {
        name: "(6.1.7) ระยะเวลาที่น้ำท่วมขัง (ในเขตที่อยู่อาศัย) (ชั่วโมง)",
        main: "M6",
        sub: "S61",
        graph: "Graph617"
    },
    {
        name: "(6.1.8) ระดับความลึกของน้ำท่วม (ในเขตที่อยู่อาศัย) (เมตร)",
        main: "M6",
        sub: "S61",
        graph: "Graph618"
    },
    {
        name: "(6.1.9) หมู่บ้านในพื้นที่น้ำท่วมที่มีการเตือนภัยและมาตรการช่วยเหลือต่อหมู่บ้านทั้งหมดในพื้นที่น้ำท่วม (ร้อยละ)",
        main: "M6",
        sub: "S61",
        graph: "Graph619"
    },
    {
        name: "(6.2.1) มูลค่าความเสียหายจากภัยแล้งต่อปี/พื้นที่ทั้งหมด (บาท/ตร.กม.)",
        main: "M6",
        sub: "S62",
        graph: "Graph621"
    },
    {
        name: "(6.2.2) พื้นที่แล้งซ้ำซากต่อพื้นที่ทั้งหมด (ร้อยละ)",
        main: "M6",
        sub: "S62",
        graph: "Graph622"
    },
    {
        name: "(6.2.3) พื้นที่เกษตรกรรมในพื้นที่แล้งซ้ำซากต่อพื้นที่เกษตรกรรมทั้งหมด (ร้อยละ)",
        main: "M6",
        sub: "S62",
        graph: "Graph623"
    },
    {
        name: "(7.1) พื้นที่ป่าไม้ต่อพื้นที่ทั้งหมด (ร้อยละ)",
        main: "M7",
        sub: null,
        graph: "Graph701"
    },
    {
        name: "(7.2) ความสมบูรณ์ของป่าไม้ (NDVI)",
        main: "M7",
        sub: null,
        graph: "Graph702"
    },
    {
        name: "(7.3) พื้นที่ทั้งหมด/จำนวนองค์กรด้านการอนุรักษ์และจัดการป่า (ตร.กม./องค์กร)",
        main: "M7",
        sub: null,
        graph: "Graph703"
    },
    {
        name: "(8.1.1) พื้นที่ทั้งหมด/แผนการจัดการน้ำ (ตร.กม./แผน)",
        main: "M8",
        sub: "S81",
        graph: "Graph811"
    },
    {
        name: "(8.2.1) โครงการชลประทานที่มีส่วนร่วมต่อโครงการชลประทานทั้งหมดในพื้นที่ (ร้อยละ)",
        main: "M8",
        sub: "S82",
        graph: "Graph821"
    },
    {
        name: "(8.3.1) พื้นที่ทั้งหมด/จำนวนองค์กรจัดการน้ำในพื้นที่ลุ่มน้ำ (ตร.กม./องค์กร)",
        main: "M8",
        sub: "S83",
        graph: "Graph831"
    },
    {
        name: "(8.4.1) GPPต่อปริมาณน้ำต้นทุน (บาท/ลบ.ม.)",
        main: "M8",
        sub: "S84",
        graph: "Graph841"
    },
    {
        name: "(8.4.2) GPPต่อประชากร (บาท/คน)",
        main: "M8",
        sub: "S84",
        graph: "Graph842"
    },
    {
        name: "(8.4.3) จำนวนประชากรวัยทำงานต่อประชากรทั้งหมด (ร้อยละ)",
        main: "M8",
        sub: "S84",
        graph: "Graph843"
    },
    {
        name: "(8.4.4) พื้นที่ทั้งหมด/การวิจัยด้านการจัดการทรัพยากรน้ำ (ตร.กม./โครงการ)",
        main: "M8",
        sub: "S84",
        graph: "Graph844"
    },
    {
        name: "(8.5.1) ทางน้ำที่มีสภาพเหมาะสมในการขนส่งทางน้ำต่อทางน้ำทั้งหมด (ร้อยละ)",
        main: "M8",
        sub: "S85",
        graph: "Graph851"
    },
    {
        name: "(8.6.1) ความครอบคุมของระบบติดตามตรวจสอบ (ตร.กม./สถานี)",
        main: "M8",
        sub: "S86",
        graph: "Graph861"
    },
    {
        name: "(8.6.2) ระบบติดตามตรวจสอบที่มีประสิทธิภาพและมีการบำรุงรักษาต่อระบบทั้งหมด (ร้อยละ)",
        main: "M8",
        sub: "S86",
        graph: "Graph862"
    },
    {
        name: "(8.7.1) อ่างเก็บน้ำที่มีการจัดสรรอย่างเป็นระบบต่ออ่างเก็บน้ำทั้งหมด (ร้อยละ)",
        main: "M8",
        sub: "S87",
        graph: "Graph871"
    }
]